{
  "data": [
    {
      "key": "Start",
      "values": [
        "Your eyes adjust to the dim light, revealing a vast cavern...",
        "Gradually, the shadows recede as your eyes acclimate, showcasing the sprawling vastness of the cavern...",
        "In the muted radiance, your sight sharpens, revealing the immense depth and breadth of the cavern...",
        "The dimness slowly gives way to discernible shapes and shades, as the grandeur of a vast cavern becomes evident..."
      ],
      "color": ""
    },
    {
      "key": "Room",
      "values": [
        "You are in cavern %d.\n"
      ],
      "color": ""
    },
    {
      "key": "Tunnels",
      "values": [
        "Tunnels lead to %s.\n",
        "Mysterious routes point to %s.\n",
        "Pathways branch out to %s.\n",
        "Corridors extend towards %s.\n"
      ],
      "color": ""
    },
    {
      "key": "BatsNearby",
      "values": [
        "The distant fluttering of bats reaches your ears!",
        "The faint echoes of bat wings rustle in the distance!",
        "You catch the soft whispers of bats flitting somewhere near!"
      ],
      "color": "cyan"
    },
    {
      "key": "PitsNearby",
      "values": [
        "A chilling draft suggests the presence of a pit nearby!",
        "An eerie breeze sends shivers down your spine, signaling a nearby pit!",
        "The cool draft you feel suggests the lurking danger of a nearby pit!",
        "A sudden gust hints at the abyssal depths of a pit close by!"
      ],
      "color": "cyan"
    },
    {
      "key": "WumpusNearby",
      "values": [
        "An unmistakable scent hints at a Wumpus lurking nearby!",
        "The unique stench of the Wumpus alerts you to its possible presence nearby!",
        "An odorous whiff raises your guard; a Wumpus could be close!"
      ],
      "color": "cyan"
    },
    {
      "key": "ChoiceShootMove",
      "values": [
        "Move or Shoot ? ( M / S ): "
      ],
      "color": "bold"
    },
    {
      "key": "WhereTo",
      "values": [
        "Where to ? ( %s ): "
      ],
      "color": "bold"
    },
    {
      "key": "WhereToArrow",
      "values": [
        "➵ Aim your arrow towards the next cavern: ( %s ): "
      ],
      "color": "bold"
    },
    {
      "key": "NotNumber",
      "values": [
        "This is not a number."
      ],
      "color": "dim"
    },
    {
      "key": "NotValidDest",
      "values": [
        "That path is blocked. Choose another direction!"
      ],
      "color": "dim"
    },
    {
      "key": "StumbledWumpus",
      "values": [
        "You accidentally stumbled upon the Wumpus!",
        "To your surprise, you find yourself face-to-face with the Wumpus!",
        "Without warning, you come upon the Wumpus!",
        "Suddenly, the looming figure of the Wumpus stands before you!"
      ],
      "color": "yellow"
    },
    {
      "key": "StartledWumpus",
      "values": [
        "Your presence spooked the Wumpus, causing it to flee!",
        "The Wumpus, alarmed by your presence, hastily retreats!",
        "You've startled the Wumpus, and it dashes away in a panic!",
        "Your sudden arrival sends the Wumpus scurrying into the shadows!",
        "Caught off guard, the Wumpus bolts away to find a safer hideout!"
      ],
      "color": "yellow"
    },
    {
      "key": "KilledByWumpus",
      "values": [
        "☠ The Wumpus, rising from the abyss, tears you apart in its hunger! ☠",
        "☠ The Wumpus, emerging from the shadows, made you its prey! ☠",
        "☠ The lurking Wumpus caught you off-guard! Your adventure ends here ☠",
        "☠ In a fateful encounter, the Wumpus proved to be your doom! ☠",
        "☠ The Wumpus, swift and silent, ended your journey abruptly! ☠",
        "☠ Before you can react, the Wumpus's claws and fangs bring your quest to a grisly end! ☠",
        "☠ The chilling roar of the Wumpus is the last thing you hear as it devours you whole! ☠"
      ],
      "color": "red"
    },
    {
      "key": "BatTeleport",
      "values": [
        "A giant bat took you away and dropped you into cavern %d!\n",
        "With a flurry of wings, a giant bat snatches you up, depositing you in a new cavern %d!\n",
        "Suddenly, talons grip you! A bat swiftly carries you aloft, dropping you in unfamiliar cavern %d.\n",
        "The shadows move, and before you realize, a bat has whisked you away, setting you down in cavern %d. Stay alert!\n"
      ],
      "color": "yellow"
    },
    {
      "key": "FellIntoPit",
      "values": [
        "☠ You lost your footing and plummeted into a bottomless pit!! ☠",
        "☠ Misstepping, you plummet into the abyss of a bottomless pit! ☠",
        "☠ The ground betrays you, sending you falling into a dark void! ☠",
        "☠ You lost your balance and met your end in the depths below! ☠"
      ],
      "color": "red"
    },
    {
      "key": "MovedTo",
      "values": [
        "Venturing forth, you emerge in cavern %d\n",
        "Navigating the dimly lit tunnels, you find yourself in cavern %d.\n",
        "With cautious steps, you transition into the embrace of cavern %d.\n",
        "The winding paths lead you onward to the heart of cavern %d.\n",
        "A gentle echo announces your arrival in cavern %d.\n",
        "The path unfolds before you, revealing the secrets of cavern %d.\n",
        "Pushing forth, the mysteries of cavern %d lay before you.\n",
        "The tunnel's end opens up to the expanse of cavern %d.\n",
        "With each step, the ambiance changes, signaling your entry into cavern %d.\n",
        "Leaving the familiar behind, you're greeted by the sights and sounds of cavern %d.\n",
        "As the previous chamber fades, the allure of cavern %d beckons.\n"
      ],
      "color": ""
    },
    {
      "key": "PlayAGain",
      "values": [
        "Would you like to venture again into the unknown? (Y/N):",
        "Do you dare to brave the caverns once more? (Y/N):",
        "Will you challenge fate and re-enter the depths? (Y/N):",
        "Are you prepared to tread the perilous paths once more? (Y/N):"
      ],
      "color": "bold"
    },
    {
      "key": "DontUnderstand",
      "values": [
        "I'm sorry I couldn't quite catch that..."
      ],
      "color": "dim"
    },
    {
      "key": "FireArrow",
      "values": [
        "You fired a curved arrow ➶"
      ],
      "color": ""
    },
    {
      "key": "SelectPower",
      "values": [
        "How far into the caverns will you let the arrow fly? (1-5):"
      ],
      "color": "bold"
    },
    {
      "key": "ArrowTravel",
      "values": [
        "➵ The arrow arcs gracefully, eventually reaching cavern %d.\n",
        "➵ The arrow sails seamlessly, currently soaring through cavern %d.\n",
        "➵ Gliding smoothly, the arrow traverses the expanse of cavern %d.\n",
        "➵ With unwavering momentum, the arrow sweeps across cavern %d.\n",
        "➵ The arrow's flight cuts a path right through the heart of cavern %d.\n",
        "➵ Whistling through the air, the arrow charts its course via cavern %d.\n",
        "➵ The arrow continues its airborne journey, now crossing cavern %d.\n",
        "➵ Casting shadows on the walls, the arrow swiftly passes through cavern %d.\n",
        "➵ With a swift elegance, the arrow makes its way through the vastness of cavern %d.\n"
      ],
      "color": ""
    },
    {
      "key": "KilledWumpus",
      "values": [
        "➵ With a triumphant strike, your arrow fells the Wumpus! Victory is yours!",
        "➵ With a resounding impact, your arrow finds its mark! The Wumpus falls defeated! Victory is yours! ☠",
        "➵ As the echo of the arrow's flight fades, the Wumpus lets out a final cry! You've vanquished the beast! ☠",
        "➵ Your aim is true, and the Wumpus is no more! Triumph awaits you! ☠",
        "➵ Against all odds, you've bested the Wumpus with a single shot! Celebrate your prowess! ☠",
        "➵ The caverns fall silent as the Wumpus meets its end by your arrow! Well done, adventurer! ☠"
      ],
      "color": "yellow"
    },
    {
      "key": "ArrowStartle",
      "values": [
        "➴ The curved arrow struck the ground, startling the Wumpus !",
        "➴ The arrow's descent to the ground unsettles the nearby Wumpus!",
        "➴ The arrow thuds against the cavern floor, sending the Wumpus into a panic!",
        "➴ With a resounding clatter, the arrow lands, causing the Wumpus to flinch!"
      ],
      "color": "yellow"
    },
    {
      "key": "ArrowFell",
      "values": [
        "➴ The arrow loses its momentum, falling harmlessly to the cavern floor.",
        "➴ Gradually losing speed, the arrow settles quietly onto the ground.",
        "➴ With a waning velocity, the arrow descends, touching down without incident.",
        "➴ The arrow's flight falters, causing it to gently land on the cavern's surface."
      ],
      "color": ""
    },
    {
      "key": "ArrowPlayer",
      "values": [
        "➴ A miscalculation! Your own arrow returns to strike you down! ☠",
        "➴ A grave error! Your arrow veers back, sealing your fate! ☠",
        "➴ Fate's cruel twist! The arrow you loosed turns on you! ☠",
        "➴ Misfortune strikes as your own arrow becomes your undoing! ☠",
        "➴ A twist of destiny! Your arrow's return course brings your end! ☠"
      ],
      "color": "red"
    },
    {
      "key": "WumpusTrample",
      "values": [
        "In its panic, the Wumpus rampages through, trampling you in the process! ☠",
        "In its frenzied escape, the Wumpus barrels over you, ending your journey! ☠",
        "Overwhelmed by fear, the Wumpus charges blindly, crushing you beneath! ☠",
        "The terrified Wumpus's hasty retreat proves fatal for you! ☠",
        "Caught in the Wumpus's frantic dash, you meet a tragic end! ☠"
      ],
      "color": "red"
    },
    {
      "key": "Turns",
      "values": [
        "You completed level %d in %d turns, %s, firing %d arrows and visiting %d caverns.\n"
      ],
      "color": "dim"
    },
    {
      "key": "Exit",
      "values": [
        "As you retreat from the echoing depths of the caverns, a serene silence envelops you. Thank you for venturing into the unknown with us. Until our paths cross again in the shadows... Farewell, brave adventurer.",
        "Your hunt for the Wumpus concludes, for now. Till we meet in the caverns again.",
        "The Wumpus remains elusive as you depart. Until another quest calls you back.",
        "You choose to leave the caverns, but the Wumpus awaits your return. Farewell for now."
      ],
      "color": "dim"
    },
    {
      "key": "ExitWumpus",
      "values": [
        "The Wumpus was hidden in cavern %d\n"
      ],
      "color": "dim"
    },
    {
      "key": "NoMoreArrows",
      "values": [
        "➴ You don't have any arrows left !"
      ],
      "color": "yellow"
    },
    {
      "key": "RemainingArrows",
      "values": [
        "➵ You have %d remaining arrows.\n"
      ],
      "color": ""
    },
    {
      "key": "FirstDoorDiscoveryNoKey",
      "values": [
        "In a dimly lit alcove, you stumble upon a door unlike any other, its very presence an enigma. Its locked nature piques your curiosity, urging you to search for a way to access its other side.",
        "As you navigate the winding paths of the cavern, an imposing door with intricate engravings stands before you, sealing away its secrets. Without a key, you wonder how to unlock its mysteries.",
        "Amidst the shadows, the silhouette of a grand door looms. Adorned with symbols from an age long past, it poses a silent challenge: Find the key, unveil its secrets.",
        "The rhythmic echo of your footsteps halts abruptly as you face an ornate door, an obvious relic from ancient times. You're met with a locked barrier, urging you to find its corresponding key.",
        "As you traverse deeper into the labyrinth, a mysterious door stands sentinel, its purpose unknown. You ponder the whereabouts of the key that might unlock its story."
      ],
      "color": "yellow"
    },
    {
      "key": "BackAgainDoorNoKey",
      "values": [
        "Wandering through the labyrinth, you find yourself back at the mysterious door that had captivated your curiosity earlier. Its silent presence taunts you, and the absence of a key keeps its secrets just out of reach.",
        "The familiar patterns of the grand door greet you as you navigate the winding paths. A pang of frustration hits; despite your exploration, the key remains a missing piece in this puzzle.",
        "Once again, the cavern leads you to the ornate door you'd encountered before. It stands stoically, waiting for its key, a testament to the mysteries yet undiscovered in this maze.",
        "The twists and turns of the cavern converge back to the imposing door you'd stumbled upon earlier. The weight of its locked state is palpable, and the elusive key continues to be a beacon of challenge.",
        "You circle back to the enigmatic door that once held your gaze. Its secrets remain locked behind its grand facade, and without the key, it stands as a monument to the adventure yet to be unraveled."
      ],
      "color": "yellow"
    },
    {
      "key": "FirstKeyDiscoveryNoDoor",
      "values": [
        "Tucked away in a crevice, a mysterious key gleams faintly. Intrigued, you reach out, securing the key and pondering its potential use.",
        "Hidden among the stones, an intricate key captures your gaze. Curiosity piqued, you carefully pick it up, wondering about its origins.",
        "As you traverse the cavern, you stumble upon an enigmatic key with elaborate engravings. Without hesitation, you take it, sensing its significance.",
        "In a dimly lit nook, a peculiar key with a lustrous sheen awaits. Compelled by its mystique, you decide to claim it for your journey ahead.",
        "Amongst the relics of the cavern, an ornate key stands out, beckoning to be taken. You grasp it, feeling its cool weight and unspoken promise.",
        "You come across an arcane key, its craftsmanship suggesting age and purpose. Drawn to its mystery, you take it, hoping it'll unlock secrets later on."
      ],
      "color": "yellow"
    },
    {
      "key": "DoorThenKey",
      "values": [
        "You're instantly reminded of the door's enigmatic aura when you discover a key bearing similar motifs. Convinced it's more than mere coincidence, you take the key, eager to see if it unlocks the previous mystery.",
        "Tucked away in a corner, a key of intricate design beckons. The mysterious door from earlier springs to mind. Could this be its counterpart? With a mix of hope and curiosity, you decide to claim the key.",
        "As you explore, a peculiar key catches your eye, and your mind drifts to the locked door you had come across. Perhaps this key could be the gateway? With anticipation, you take it with you.",
        "The memory of that sealed door flashes back as you stumble upon a key with ancient symbols. Intrigued and optimistic, you secure the key, wondering if it might be the answer to the door's riddle.",
        "Earlier, the sight of that imposing, locked door had puzzled you. Now, as you hold a mysterious, ornate key that you've just found, hope flickers. Could this be its match? You take the key, eager to find out.",
        "Recalling the enigmatic door you encountered earlier, a sense of purpose fills you as you discover a beautifully crafted key hidden in the shadows. Without a second thought, you pocket it, hoping it might reveal the door's secrets."
      ],
      "color": "yellow"
    },
    {
      "key": "KeyThenDoor",
      "values": [
        "The ornate key you found earlier feels heavy in your pocket as you face a magnificent door, its designs eerily similar. An air of destiny surrounds you, hinting that the key might unveil the door's concealed world.",
        "Your fingers instinctively clutch the mysterious key you discovered earlier as you come upon an imposing door. The designs mirror each other, suggesting they're intrinsically linked. It's time to see if the key fits.",
        "As a grand door with ancient motifs presents itself, memories of the key you picked up flood back. The connection seems unmistakable. With anticipation, you approach, ready to test your earlier find.",
        "Before you stands a door, cloaked in mystery and echoing tales of old. The key you'd stumbled upon earlier now feels purposeful, as if it's the missing piece of this puzzle.",
        "The sight of the enigmatic door reminds you of the key you found. With symbols and engravings that seem to tell of a shared history, you can't help but wonder if the key might unlock the door's secrets."
      ],
      "color": "yellow"
    },
    {
      "key": "WumpusStillAlive",
      "values": [
        "However, a sense of duty holds you back. The echoing growls of the Wumpus are a reminder that your quest is not yet complete.",
        "Yet, as you stand at the threshold, you realize your mission remains unfinished. The Wumpus still lurks, and you cannot leave it unchecked.",
        "But a lingering unease prevents your exit. The Wumpus, that menacing beast, still roams the labyrinth. Your job isn't done.",
        "Although freedom beckons, a nagging thought anchors you. The Wumpus is still at large, and you're not one to leave a task half-done.",
        "But you resist the call of the outside world. Somewhere in the shadows, the Wumpus waits, and you're determined to confront it."
      ],
      "color": "yellow"
    },
    {
      "key": "DoorKeyDoor",
      "values": [
        "Returning to the cavern that houses the mysterious door, you feel the weight of the key you've since discovered. Anticipation grows as you approach, ready to unlock the door's long-held secrets.",
        "The winding paths of the labyrinth lead you back to the grand door. With the newly acquired key in hand, the moment feels ripe to finally reveal what lies beyond its imposing facade.",
        "With the ornate key you found, you trace your steps back to the enigmatic door that once stood as an inscrutable barrier. A sense of destiny fills the air as you inch closer to unveiling its mysteries.",
        "The familiar designs of the door beckon as you navigate the cavern once more. The key, now in your possession, promises to shed light on the door's hidden tales.",
        "Back in the chamber where the intricate door first captured your wonder, the key you've discovered feels like the final piece of this puzzle. The anticipation is palpable as you prepare to turn it, bridging the gap between mystery and revelation."
      ],
      "color": "yellow"
    },
    {
      "key": "ExitDoor",
      "values": [
        "With a deep breath, you turn the key and the door gradually gives way, leading you to the world outside the maze.",
        "Holding the key, a moment of clarity strikes. With a swift motion, you unlock the door, and it swings open to display the vast expanse outside the maze.",
        "The intricate design of the key glints under the dim light. Turning it, the door eases open, showing the boundless horizon beyond the labyrinth.",
        "With the key's cold metal pressed against your fingers, anticipation mounts. Unlocking the door, it opens up to the freedom of the world outside."
      ],
      "color": "yellow"
    },
    {
      "key": "GoNextLevel",
      "values": [
        "With a deep breath, you turn the key and the door slowly opens, revealing an even deeper level of the maze.",
        "Holding the key, a moment of clarity strikes. With a swift motion, you unlock the door, and it swings open to show the intricate depths of the next level.",
        "The intricate design of the key catches a glimmer of dim light. Turning it, the door eases open, unveiling the shadowy passages of another maze layer below.",
        "With the key's cold metal pressed against your fingers, anticipation mounts. Unlocking the door, it beckons you to the challenges of the deeper maze level ahead.",
        "The key's intricate grooves fit perfectly into the lock. As you turn it, the door creaks open, beckoning you into the enigmatic depths of a deeper maze layer.",
        "As the key slides smoothly into the lock, a chilling draft emanates from beyond the door. It opens, drawing you into the hidden complexities of another maze level.",
        "With a determined twist of the key, the once-impenetrable door yields, revealing a descending path into the next layer of the labyrinth.",
        "The weight of the key reassures you of its purpose. As you unlock and push open the door, the allure of deeper challenges within the maze pull you forward.",
        "Guided by intuition, you insert the key, hearing the tumblers fall into place. The door swings inward, presenting the winding twists and turns of a further maze level."
      ],
      "color": "yellow"
    },
    {
      "key": "NowExit",
      "values": [
        "Your next challenge: navigating your way out of this maze.",
        "The labyrinth stretches before you; find the path to freedom.",
        "Trapped within these winding walls, you must seek an exit.",
        "With the Wumpus behind, the puzzle of this maze remains. Find your way out.",
        "The twisting corridors beckon; your escape awaits if you can find it.",
        "Lost within the labyrinth's embrace, only your wits can guide you out.",
        "The maze's secrets are yet to be unveiled; forge your path to the outside."
      ],
      "color": "yellow"
    },
    {
      "key": "MaybeDoor",
      "values": [
        "Could the enigmatic door you stumbled upon be your passage out?",
        "Might the mysterious door you chanced upon lead to freedom?",
        "Is the cryptic door you found earlier the exit you desperately seek?",
        "Could this elusive door you encountered be your key to the world outside?",
        "Perhaps the enshrouded door you noticed earlier beckons your escape?"
      ],
      "color": "yellow"
    },
    {
      "key": "MaybeKey",
      "values": [
        "The ornate key you discovered might hold answers to this labyrinth's riddles.",
        "The intricate key you chanced upon might be the solution to this maze's mysteries.",
        "The elaborate key you unearthed could be the answer to unlocking the maze's secrets.",
        "Perhaps the detailed key you found offers clues to navigating this labyrinth.",
        "The beautifully-crafted key you came across might be the pivotal piece in this puzzling labyrinth."
      ],
      "color": "yellow"
    },
    {
      "key": "CertainKeyDoor",
      "values": [
        "The door for which you have the key calls to you. It's time to retrace your steps and make your way to the surface through that passage!",
        "The door, now accessible with your key, beckons you. Retrace your journey and find your way out through that gateway!",
        "With key in hand, the door you remember awaits. It's time to journey back and discover what lies beyond it!",
        "The portal for which you possess the key is your potential salvation. Navigate your way back and see if it leads to freedom!",
        "Recalling the door that matches your newfound key, you feel a pull towards it. Head back and see if it's your passage to the surface!",
        "Your key promises an exit through that remembered door. Revisit your path and unlock your way to the world above!",
        "The door you encountered earlier seems all the more significant with the key you hold. Return to it and hopefully embrace the daylight once more!"
      ],
      "color": "yellow"
    },
    {
      "key": "FoundClue",
      "values": [
        "An ancient cave painting in this chamber depicts %s. Strikingly, the number %d appears repeatedly, suggesting it holds some significance.\n",
        "You uncover a tattered parchment. The words have faded, but you discern mentions of %s and the unmistakable hint of cavern %d.\n",
        "Enigmatic engravings on a nearby wall recount legends of %s. A pattern emerges, pointing you towards cavern %d.\n",
        "A stone tablet, etched with cryptic symbols, rests here. Its imagery seems to associate %s with cavern %d. Could this be a lead?\n",
        "Hidden beneath dust, an intricate mosaic emerges. It seems to convey a story of %s, with arrows guiding toward cavern %d.\n",
        "You find an old scroll, its edges frayed. Skimming through, mentions of %s grab your attention, alongside consistent references to cavern %d.\n",
        "Frescoes on the chamber walls hint at %s's lore. As you decipher them, you become convinced that they're directing you to cavern %d.\n",
        "In a concealed alcove, a cryptic diary lies open. Entries speak of %s, emphasizing the importance of cavern %d in your quest.\n",
        "Amidst the rocky floor, a half-buried book reveals itself. Its tales of %s are intertwined with veiled references to cavern %d.\n",
        "Splattered ink drawings on parchment depict scenes with %s. At the margins, a recurrent theme nudges you towards cavern %d.\n",
        "Whispers of past explorers come to mind as you uncover carved notes on the wall, with %s at its core, hinting at the significance of cavern %d.\n"
      ],
      "color": "yellow"
    },
    {
      "key": "PartialMap",
      "values": [
        "You stumble upon an aged piece of parchment, its edges fraying. Despite the wear, some distinct symbols and lines remain visible:%s",
        "Among the rubble, you uncover a brittle sheet of paper. Faintly etched diagrams and numbers intrigue your gaze:%s",
        "Hidden in a nook, a velum sheet catches your eye. Weathered by time, cryptic symbols still beckon to be understood:%s",
        "An ancient scroll rolls out at your feet. The drawings and figures on it, though faded, pique your curiosity:%s",
        "Tucked behind a stone, a piece of parchment reveals itself. Amidst its scars, a series of numbers connected by lines can be discerned:%s",
        "A piece of paper, tinged yellow with age, emerges from the shadows. Though the ink has faded, mysterious symbols remain intact:%s",
        "Under a pile of debris, you find a velum. Its surface is adorned with almost ghostly figures and connecting paths:%s",
        "You discover an old scroll, sealed for ages. Unfurling it, you're greeted by an array of diagrams and interconnected points:%s",
        "Dust covers an abandoned piece of parchment. Beneath the layer, the remnants of symbols and networked lines become apparent:%s",
        "Amidst the scattered artifacts, a paper stands out. Intricate patterns and linked numbers remain, hinting at some hidden logic:%s",
        "Nestled in a crevice, a velum awaits your discovery. Its surface is etched with enigmatic symbols and linking pathways:%s",
        "You chance upon a fragile scroll, its designs nearly consumed by time. With care, you trace the interconnected symbols and numerals:%s"
      ],
      "color": "yellow"
    },
    {
      "key": "SleepWalkWumpus",
      "values": [
        "A heavy, rhythmic thudding echoes through the tunnels. The Wumpus is on the move...",
        "The ground subtly vibrates beneath your feet, hinting at the Wumpus's restless wanderings.",
        "A distant, muffled sound of shifting rocks and gravel suggests the Wumpus is sleepwalking.",
        "The stillness of the cave is punctuated by the unmistakable shuffle of the Wumpus's movement.",
        "You catch the soft echoes of a large creature stirring in a distant part of the labyrinth.",
        "An eerie silence momentarily fills the air before being replaced by the slow, deliberate sounds of the Wumpus's footsteps.",
        "A faint, dragging noise reverberates through the caverns, suggesting the Wumpus is moving in the abysses...",
        "The cavern walls carry the distant, resonant sounds of the Wumpus's sleepy wanderings.",
        "A peculiar series of bumps and thuds echo in the dark, signaling the Wumpus's nocturnal roamings.",
        "The muted, rhythmic sound of heavy breathing suggests the Wumpus, in a somnolent state, is on the move."
      ],
      "color": "cyan"
    },
    {
      "key": "Earthquake",
      "values": [
        "The ground quakes beneath your feet, a telltale sign of the labyrinth reshaping itself, perhaps sealing off or forming new pits.",
        "A sudden tremor ripples through the caverns, hinting at unseen crevices opening or closing in the distance.",
        "With a jolting shake, the very foundation of the caves seems to shift, possibly changing the dangerous terrain below.",
        "You brace yourself as an unexpected tremble courses through the tunnels. Somewhere, the cavern is either swallowing or releasing its deep pits.",
        "The cavern walls quiver, a chilling indication that the treacherous pits within are ever-changing.",
        "With a deep rumble, the ground momentarily heaves, a reminder of the cavern’s living nature and its evolving pitfalls.",
        "A seismic jolt echoes through the maze, signaling the birth or death of another treacherous crevice.",
        "The echoes of a distant quake reverberate around you, suggesting the cavern's ever-shifting layout of pits and pathways.",
        "You feel an unsettling shift underfoot, an alarming precursor to the caverns either forming or sealing off its hidden pits.",
        "An ominous vibration courses through the labyrinth, a stark reminder of the volatile nature of the underground and its capricious crevices."
      ],
      "color": "cyan"
    },
    {
      "key": "BatMigration",
      "values": [
        "A gust of wind, accompanied by a faint flapping, fills the cavern. The bats are surely on the move.",
        "The subtle rustle of air and the soft beat of wings reach your ears, hinting at the restless bats shifting through the tunnels.",
        "A gentle zephyr stirs the stillness, carrying with it the telltale sound of bats in flight.",
        "Echoes of fluttering wings brush past you, a clear sign of bats dancing through the dark corridors.",
        "The hushed whispers of the breeze meld with the flittering of bat wings, signaling their nocturnal migration within the labyrinth.",
        "A fleeting wind rushes by, entwined with the delicate sound of bats on the wing, hinting at their movements in the shadows.",
        "The cavern's stillness is punctuated by a gentle airflow and the distant murmur of bats in motion.",
        "With the light flutter of wings and a fleeting draft, you're alerted to the bats' silent ballet in the dark.",
        "The soft patter of bat wings on the move melds with a cool breeze, reminding you of the ever-changing dynamics of the cavern.",
        "A transient gust whispers tales of restless bats, weaving their way through the underground maze."
      ],
      "color": "cyan"
    },
    {
      "key": "TermitesNearby",
      "values": [
        "The subtle rustling of your magic arrows breaks the silence, hinting at the nearby presence of termites.",
        "A faint quivering emanates from your quiver. Termites must be close.",
        "The arrows within your quiver shiver gently, a telltale sign of termites in the vicinity.",
        "Your magic arrows seem restless, their subtle vibrations signaling the nearby presence of wood-hungry termites.",
        "A distinct murmur arises from your quiver. The termites must be lurking nearby.",
        "The arrows, sensitive to their surroundings, shudder softly. They sense the termites before you do.",
        "The gentle rustling of fletching in your quiver warns you: termites are near.",
        "Your quiver trembles ever so slightly, a sure indication of termites in the shadows.",
        "A soft buzzing resonates from your magic arrows, alerting you to the close proximity of termites.",
        "The hairs on the back of your neck stand as your quiver reacts subtly. The termites are undoubtedly close."
      ],
      "color": "cyan"
    },
    {
      "key": "TermiteMigration",
      "values": [
        "A distinct bristling in the air tells you that somewhere in the caverns, a colony of termites is on the move.",
        "The ambient energy shifts subtly, indicating that the termites are migrating deep within the caverns.",
        "An underlying hum reverberates through the cavern walls, signifying the great migration of termites.",
        "The atmosphere grows tense; a clear sign of termite colonies journeying through the labyrinthine depths.",
        "A gentle, yet persistent, vibration underfoot hints at the vast migration of termites within the caverns.",
        "The caverns echo with a soft rustling, a chorus of termites making their migratory journey.",
        "A palpable shift in the cavern's mood suggests the termites are on a great trek, relocating en masse.",
        "The very walls seem to hum with anticipation as the colony of termites begins its migration through the vastness of the caverns.",
        "An unmistakable thrumming envelops you, heralding the vast migration of termites in the depths beyond.",
        "A subtle, yet pervasive, resonance fills the air – the termites are on the move, journeying through the cavernous expanse."
      ],
      "color": "cyan"
    },
    {
      "key": "TermiteEatArrow",
      "values": [
        "As you step into the cavern, a swarm of menacing flying termites descends upon your quiver, consuming one of your arrows in their frenzy!",
        "Entering the room, you're ambushed by aggressive termites that take to the air, targeting your quiver and devouring an arrow before you can react.",
        "The moment you set foot in the cavern, ravenous flying termites surround you, hungrily making a meal of one of your precious arrows.",
        "No sooner do you enter the room than a cloud of malevolent termites swoops down, snatching away and consuming one of your arrows.",
        "The cavern's shadowy depths release a horde of flying termites which, to your horror, rush your quiver and feast on an arrow.",
        "The moment you penetrate the room's threshold, airborne termites dart toward your quiver, greedily nibbling away one of your arrows.",
        "As the cavern's darkness engulfs you, you feel a sudden surge of movement – flying termites have ambushed your quiver, and you find yourself an arrow short.",
        "The cavern seems to come alive as you enter, with menacing termites taking flight and swarming your quiver, stripping away one of your arrows.",
        "A chilling breeze accompanies your entry into the room, followed by the swift onslaught of flying termites that eagerly consume one of your arrows.",
        "The ominous feeling in the cavern deepens as a swarm of aggressive flying termites make a beeline for your quiver, making short work of one of your arrows."
      ],
      "color": "yellow"
    },
    {
      "key": "FoundRepel",
      "values": [
        "Hidden in a crevice, you discover a small vial filled with a pungent liquid. The label suggests it keeps winged creatures at bay.",
        "As you rummage through the cavern's treasures, you find an ancient talisman reputed to ward off creatures of the night.",
        "Amongst the detritus, a gleaming amulet catches your eye. Legend has it that such amulets deter bats and their ilk.",
        "In a forgotten corner of the cavern, a pouch of fragrant herbs awaits. Its scent seems to make the fluttering shadows keep their distance.",
        "A soft glow emanates from a potion bottle left on a rock. Taking a closer look, you recall tales of such concoctions repelling winged pests.",
        "Stumbled upon an old tome, you read about the power of a certain resin in repelling flying creatures. Next to the book, a sample of this very resin!",
        "A whispering echo guides you to a concealed alcove. Therein lies a charm said to keep bats at arm's length.",
        "A gleaming dust covers the floor of a nook in the cavern. Collecting some, you realize it's famed for making bats turn tail and flee.",
        "Deep within the cave, an enchanted feather beckons. Holding it, you sense its power to repel airborne threats.",
        "In the dim light, a shimmering cloak seems to pulse with energy. Draping it around you, you instantly feel a barrier against bats form."
      ],
      "color": "yellow"
    },
    {
      "key": "UseRepel",
      "values": [
        "A flurry of giant bats descends upon you! But they veer away sharply as the protective item you found earlier activates. After the bright flash, the item turns to ash in your hand.",
        "Sudden rustling alerts you to bats diving straight for you. Yet, the safeguard you picked up before releases a burst of energy, repelling them. It's now spent and disintegrates.",
        "The cavern air is cut by swift wings. As the bats approach, the protective mechanism you're carrying pulses and deters their advance. Its power diminishes after use.",
        "A dark cloud of bats hurtles toward you from above. Thankfully, the deterrent you discovered earlier emits a force, making them scatter. It crumbles, having fulfilled its purpose.",
        "The menacing shadows of bats close in on you swiftly. The defense you found acts, creating a barrier. They fly off, startled, as the object disintegrates.",
        "Bats, with eyes locked onto you, make their approach. Suddenly, the ward you procured shimmers, creating a safe bubble around you. Post-event, it dissipates into thin air.",
        "The chilling sensation of bat wings is felt from a distance. But the countermeasure you found shines bright, scattering them. Afterwards, the light dims and the item vanishes."
      ],
      "color": "yellow"
    },
    {
      "key": "FoundRope",
      "values": [
        "As you explore the cavern, your fingers brush against the rough texture of a coiled rope.",
        "Tucked away in a corner, you stumble upon a neatly wound length of hemp.",
        "Hidden in the shadows, a sturdy rope waits to be claimed by a fortunate adventurer.",
        "Glinting faintly in the dim light, a braided line lies coiled and ready for use.",
        "Beneath a thin layer of dust, you discover a durable rope that might prove handy.",
        "Tangled amidst some old debris, a long cord catches your attention.",
        "Lying abandoned on the cavern floor, a rope ladder waits to aid in your journey.",
        "Tied to a stalagmite, you find a rope with a grappling hook at its end.",
        "Intricately knotted and strong, a rope beckons from a crevice.",
        "Peering into a small alcove, you spot a rope belt that could serve a myriad of purposes."
      ],
      "color": "yellow"
    },
    {
      "key": "UseRope",
      "values": [
        "You misstep, plunging into a vast hole. Using your trusty rope, you manage to climb out, but the strain causes it to fray and break.",
        "As the ground disappears beneath you, you fall into a deep pit. With quick thinking, you tie your cord to a rock, ascending to safety, but the cord doesn't survive the ordeal.",
        "Stumbling, you find yourself descending rapidly into a crevice. Your lifeline, a sturdy line you found earlier, helps you scale the rocky walls but snaps as you reach the top.",
        "The earth crumbles, sending you into a void. Thankfully, the lasso you carry holds long enough for a safe ascent, but it wears thin and breaks upon reaching safety.",
        "Your foot slips, causing a tumble into a dark pit. The hawser you have wraps around a jutting stone, allowing a climb back up, but its fibers unravel by the end.",
        "Suddenly, you're in freefall, heading towards a chasm's depth. With a desperate throw, your tether catches a protruding edge. It holds just long enough for escape but tears apart afterward.",
        "You're caught off-guard as the ground opens up, but your rope provides a short-lived salvation, breaking apart after your narrow escape from the abyss.",
        "A misstep lands you in a trap, but thankfully, the coil you found becomes your temporary savior, though it frays and comes undone once you're safe."
      ],
      "color": "yellow"
    }
  ]
}